[
    {
      "riddle": "It is greater than God and more evil than the devil. The poor have it, the rich need it and if you eat it you will die. What is it?",
      "answer": "nothing"
    },
    {
      "riddle": "I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?",
      "answer": "the letter e"
    },
    {
      "riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
      "answer": "a river"
    },
    {
      "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breath on this terrestrial ball. What am I?",
      "answer": "the future"
    },
    {
      "riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?",
      "answer": "the stars"
    },
    {
      "riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?",
      "answer": "the letter n"
    },
    {
      "riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he's using it. What is it?",
      "answer": "a coffin"
    },
    {
      "riddle": "The more you have of it, the less you see. What is it?",
      "answer": "Darkness"
    },
    {
      "riddle": "What smells like purple paint, tastes like green paint, and can appear as a white dove?",
      "answer": "white paint"
    },
    {
      "riddle": "The more you take, the more you leave behind. What am I?",
      "answer": "footsteps"
    },
    {
      "riddle": "What has a head, a tail, is brown, and has no legs?",
      "answer": "a penny"
    },
    {
      "riddle": "David's father has three sons : Snap, Crackle and _____ ?",
      "answer": "David"
    },
    {
      "riddle": "What room do ghosts avoid?",
      "answer": "The living room"
    },
        {
      "riddle": "What has many keys, but can't even open a single door?",
      "answer": "A piano"
    },
        {
      "riddle": "What is black when you buy it, red when you use it, and gray when you throw it away?",
      "answer": "Charcoal"
    },
        {
      "riddle": "What belongs to you, but other people use it more than you?",
      "answer": "Your name"
    },
    {
      "riddle": "Tall I am young, Short I am old, While with life I glow, Wind is my foe. What am I?",
      "answer": "A candle"
    },
    {
      "riddle": "What is more useful when it is broken?",
      "answer": "An egg"
    },
    {
      "riddle": "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?",
      "answer": "Gloves"
    },
    {
      "riddle": "Before Mount Everest was discovered, what was the highest mountain on Earth?",
      "answer": "Mount Everest"
    },
    {
      "riddle": "If you have me, you want to share me. If you share me, you haven't got me. What am I?",
      "answer": "A Secret"
    },
        {
      "riddle": "This is as light as a feather, yet no man can hold it for long. What am I?",
      "answer": "Your breath"
    }
]